fn main() {
    // 数字字面值类型后缀
    let _ = 56u8;
    let _ = 56u16;
    // 进制前缀
    let _ = 0xff;
    let _ = 0o77;
    let _ = 0b1111_0000;
    let _ = b'A';
    // bool
    let _: bool = true;
    // char
    let _ = 'z';
    let _ = 'ℤ';
    let _ = '😻';

    // 元组
    let _: (i32, f64, u8) = (500, 6.4, 1);
    // 元组解构
    let (_, _, _) = (500, 6.4, 1);
    // 元组索引
    let _ = (500, 6.4, 1).0;

    // 数组
    let _: [i32; 5] = [1, 2, 3, 4, 5];
    let _: [i32; 5] = [0; 5];
    // 数组解构
    let [_, _, _] = [1, 2, 3];
    // 数组索引
    let _ = [1, 2, 3][0];
}
